; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v4)
		(pred_2 ?v7)
		(pred_1 ?v3)
		(pred_6 ?v3)
		(pred_3 ?v7 ?v3)
		(pred_5)
		(pred_4 ?v7))

   (:action op_3
       :parameters  (?v2 ?v8)
       :precondition (and (not-eq ?v2 ?v8) 
                          (pred_1 ?v2) (pred_1 ?v8) (pred_6 ?v2))
       :effect (and  (pred_6 ?v8)
		     (not (pred_6 ?v2))))


   (:action op_2
       :parameters (?v1 ?v5)
       :precondition  (and  (pred_2 ?v1) (pred_1 ?v5)
			    (pred_3 ?v1 ?v5) (pred_6 ?v5) (pred_5))
       :effect (and (pred_4 ?v1)
		    (not (pred_3 ?v1 ?v5)) 
		    (not (pred_5))))

   (:action op_1
       :parameters  (?v1  ?v5)
       :precondition  (and  (pred_2 ?v1) (pred_1 ?v5)
			    (pred_4 ?v1) (pred_6 ?v5))
       :effect (and (pred_3 ?v1 ?v5)
		    (pred_5)
		    (not (pred_4 ?v1)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_02 obj_07 obj_04 obj_03 obj_01 obj_05 
          obj_06 obj_08 
)
(:init
(pred_1 obj_02)
(pred_1 obj_07)
(pred_1 obj_04)
(pred_1 obj_03)
(pred_1 obj_01)
(pred_1 obj_05)
(pred_2 obj_06)
(pred_2 obj_08)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(pred_5)
(pred_3 obj_06 obj_01)
(pred_3 obj_08 obj_01)
(pred_6 obj_07)
)
(:goal
(and
(pred_3 obj_06 obj_05)
(pred_3 obj_08 obj_05)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_06 obj_05) (pred_6 obj_02))
    (sometime-before  (pred_3 obj_08 obj_05) (pred_6 obj_02))
  )
)
)

; plan
1. (op_3 obj_07 obj_01)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_01)
   goals met: 0 of 2
2. (op_2 obj_08 obj_01)
   deleted: (pred_3 obj_08 obj_01) (pred_5)
   added: (pred_4 obj_08)
   goals met: 0 of 2
3. (op_3 obj_01 obj_02)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_02)
   goals met: 0 of 2
4. (op_1 obj_08 obj_02)
   deleted: (pred_4 obj_08)
   added: (pred_3 obj_08 obj_02) (pred_5)
   goals met: 0 of 2
5. (op_3 obj_02 obj_01)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_01)
   goals met: 0 of 2
6. (op_2 obj_06 obj_01)
   deleted: (pred_3 obj_06 obj_01) (pred_5)
   added: (pred_4 obj_06)
   goals met: 0 of 2
7. (op_3 obj_01 obj_05)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_05)
   goals met: 0 of 2
8. (op_1 obj_06 obj_05)
   deleted: (pred_4 obj_06)
   added: (pred_3 obj_06 obj_05) (pred_5)
   goals met: 1 of 2
9. (op_3 obj_05 obj_02)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_02)
   goals met: 1 of 2
10. (op_2 obj_08 obj_02)
   deleted: (pred_3 obj_08 obj_02) (pred_5)
   added: (pred_4 obj_08)
   goals met: 1 of 2
11. (op_3 obj_02 obj_05)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_05)
   goals met: 1 of 2
12. (op_1 obj_08 obj_05)
   deleted: (pred_4 obj_08)
   added: (pred_3 obj_08 obj_05) (pred_5)
   goals met: 2 of 2
